guides/cursor/baselines/gotenberg_runs/k6_gotenberg_20260618_011555.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: load_test_pprof.js
        output: -

     scenarios: (100.00%) 1 scenario, 48 max VUs, 1m5s max duration (incl. graceful stop):
              * steady: 48 looping VUs for 35s (gracefulStop: 30s)

time="2026-06-18T01:15:57+05:30" level=info msg="gotenberg load: 48 VUs × 35s, scenario=tagged_ecdsa, skipNetworkIdle=true" source=console

running (0m01.0s), 48/48 VUs, 11 complete and 0 interrupted iterations
steady   [   3% ] 48 VUs  01.0s/35s

running (0m02.0s), 48/48 VUs, 25 complete and 0 interrupted iterations
steady   [   6% ] 48 VUs  02.0s/35s

running (0m03.0s), 48/48 VUs, 42 complete and 0 interrupted iterations
steady   [   9% ] 48 VUs  03.0s/35s

running (0m04.0s), 48/48 VUs, 56 complete and 0 interrupted iterations
steady   [  11% ] 48 VUs  04.0s/35s

running (0m05.0s), 48/48 VUs, 71 complete and 0 interrupted iterations
steady   [  14% ] 48 VUs  05.0s/35s

running (0m06.0s), 48/48 VUs, 88 complete and 0 interrupted iterations
steady   [  17% ] 48 VUs  06.0s/35s

running (0m07.0s), 48/48 VUs, 99 complete and 0 interrupted iterations
steady   [  20% ] 48 VUs  07.0s/35s

running (0m08.0s), 48/48 VUs, 103 complete and 0 interrupted iterations
steady   [  23% ] 48 VUs  08.0s/35s

running (0m09.0s), 48/48 VUs, 118 complete and 0 interrupted iterations
steady   [  26% ] 48 VUs  09.0s/35s

running (0m10.0s), 48/48 VUs, 137 complete and 0 interrupted iterations
steady   [  29% ] 48 VUs  10.0s/35s

running (0m11.0s), 48/48 VUs, 152 complete and 0 interrupted iterations
steady   [  31% ] 48 VUs  11.0s/35s

running (0m12.0s), 48/48 VUs, 169 complete and 0 interrupted iterations
steady   [  34% ] 48 VUs  12.0s/35s

running (0m13.0s), 48/48 VUs, 186 complete and 0 interrupted iterations
steady   [  37% ] 48 VUs  13.0s/35s

running (0m14.0s), 48/48 VUs, 199 complete and 0 interrupted iterations
steady   [  40% ] 48 VUs  14.0s/35s

running (0m15.0s), 48/48 VUs, 209 complete and 0 interrupted iterations
steady   [  43% ] 48 VUs  15.0s/35s

running (0m16.0s), 48/48 VUs, 224 complete and 0 interrupted iterations
steady   [  46% ] 48 VUs  16.0s/35s

running (0m17.0s), 48/48 VUs, 240 complete and 0 interrupted iterations
steady   [  49% ] 48 VUs  17.0s/35s

running (0m18.0s), 48/48 VUs, 256 complete and 0 interrupted iterations
steady   [  51% ] 48 VUs  18.0s/35s

running (0m19.0s), 48/48 VUs, 274 complete and 0 interrupted iterations
steady   [  54% ] 48 VUs  19.0s/35s

running (0m20.0s), 48/48 VUs, 288 complete and 0 interrupted iterations
steady   [  57% ] 48 VUs  20.0s/35s

running (0m21.0s), 48/48 VUs, 301 complete and 0 interrupted iterations
steady   [  60% ] 48 VUs  21.0s/35s

running (0m22.0s), 48/48 VUs, 318 complete and 0 interrupted iterations
steady   [  63% ] 48 VUs  22.0s/35s

running (0m23.0s), 48/48 VUs, 334 complete and 0 interrupted iterations
steady   [  66% ] 48 VUs  23.0s/35s

running (0m24.0s), 48/48 VUs, 350 complete and 0 interrupted iterations
steady   [  69% ] 48 VUs  24.0s/35s

running (0m25.0s), 48/48 VUs, 364 complete and 0 interrupted iterations
steady   [  71% ] 48 VUs  25.0s/35s

running (0m26.0s), 48/48 VUs, 379 complete and 0 interrupted iterations
steady   [  74% ] 48 VUs  26.0s/35s

running (0m27.0s), 48/48 VUs, 397 complete and 0 interrupted iterations
steady   [  77% ] 48 VUs  27.0s/35s

running (0m28.0s), 48/48 VUs, 400 complete and 0 interrupted iterations
steady   [  80% ] 48 VUs  28.0s/35s

running (0m29.0s), 48/48 VUs, 413 complete and 0 interrupted iterations
steady   [  83% ] 48 VUs  29.0s/35s

running (0m30.0s), 48/48 VUs, 428 complete and 0 interrupted iterations
steady   [  86% ] 48 VUs  30.0s/35s

running (0m31.0s), 48/48 VUs, 448 complete and 0 interrupted iterations
steady   [  89% ] 48 VUs  31.0s/35s

running (0m32.0s), 48/48 VUs, 461 complete and 0 interrupted iterations
steady   [  91% ] 48 VUs  32.0s/35s

running (0m33.0s), 48/48 VUs, 484 complete and 0 interrupted iterations
steady   [  94% ] 48 VUs  33.0s/35s

running (0m34.0s), 48/48 VUs, 501 complete and 0 interrupted iterations
steady   [  97% ] 48 VUs  34.0s/35s

running (0m35.0s), 48/48 VUs, 516 complete and 0 interrupted iterations
steady   [ 100% ] 48 VUs  35.0s/35s

running (0m36.0s), 30/48 VUs, 534 complete and 0 interrupted iterations
steady ↓ [ 100% ] 48 VUs  35s

running (0m37.0s), 11/48 VUs, 553 complete and 0 interrupted iterations
steady ↓ [ 100% ] 48 VUs  35s

running (0m38.0s), 01/48 VUs, 563 complete and 0 interrupted iterations
steady ↓ [ 100% ] 48 VUs  35s
time="2026-06-18T01:16:35+05:30" level=info msg="gotenberg load done (started 2026-06-17T19:45:57.472Z)" source=console


  █ THRESHOLDS 

    errors
    ✓ 'rate<0.05' rate=0.00%

    http_req_duration
    ✓ 'p(99)<30000' p(99)=5.88s

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1692    44.384553/s
    checks_succeeded...: 100.00% 1692 out of 1692
    checks_failed......: 0.00%   0 out of 1692

    ✓ status is 200
    ✓ response is pdf
    ✓ response has content

    CUSTOM
    active_latency.................: avg=3100        min=742      med=2961   max=6105  p(90)=4150.2 p(95)=4390.3 p(99)=6006.72
    errors.........................: 0.00% 0 out of 564
    hft_latency....................: avg=4166.533333 min=2196     med=4162.5 max=6606  p(90)=5257.4 p(95)=5415.2 p(99)=6295.12
    pdf_generation_time............: avg=3064.721631 min=416      med=2981.5 max=6606  p(90)=4379.5 p(95)=4707.4 p(99)=5888.85
    retail_latency.................: avg=2985.949451 min=416      med=2959   max=6048  p(90)=4357.6 p(95)=4699.1 p(99)=5763.9 

    HTTP
    http_req_duration..............: avg=3.05s       min=627.34µs med=2.98s  max=6.6s  p(90)=4.37s  p(95)=4.7s   p(99)=5.88s  
      { expected_response:true }...: avg=3.05s       min=627.34µs med=2.98s  max=6.6s  p(90)=4.37s  p(95)=4.7s   p(99)=5.88s  
    http_req_failed................: 0.00% 0 out of 565
    http_reqs......................: 565   14.821083/s

    EXECUTION
    iteration_duration.............: avg=3.08s       min=419.97ms med=2.98s  max=6.99s p(90)=4.45s  p(95)=4.88s  p(99)=5.93s  
    iterations.....................: 564   14.794851/s
    vus............................: 1     min=1        max=48
    vus_max........................: 48    min=48       max=48

    NETWORK
    data_received..................: 26 MB 672 kB/s
    data_sent......................: 23 MB 590 kB/s



running (0m38.1s), 00/48 VUs, 564 complete and 0 interrupted iterations
steady ✓ [ 100% ] 48 VUs  35s